src/logs/all/test-all-20250730-164221.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/test-all.ts
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 30 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  01.0s/30s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  02.0s/30s

running (0m03.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  03.0s/30s

running (0m04.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  04.0s/30s

running (0m05.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  05.0s/30s

running (0m06.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  06.0s/30s

running (0m07.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  07.0s/30s

running (0m08.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  08.0s/30s

running (0m09.0s), 30/30 VUs, 6 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  09.0s/30s

running (0m10.0s), 30/30 VUs, 25 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  10.0s/30s

running (0m11.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  11.0s/30s

running (0m12.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  12.0s/30s

running (0m13.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  13.0s/30s

running (0m14.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  14.0s/30s

running (0m15.0s), 30/30 VUs, 32 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  15.0s/30s

running (0m16.0s), 30/30 VUs, 36 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  16.0s/30s

running (0m17.0s), 30/30 VUs, 45 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  17.0s/30s

running (0m18.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  18.0s/30s

running (0m19.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  19.0s/30s

running (0m20.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  20.0s/30s

running (0m21.0s), 30/30 VUs, 62 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  21.0s/30s

running (0m22.0s), 30/30 VUs, 63 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  22.0s/30s

running (0m23.0s), 30/30 VUs, 68 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  23.0s/30s

running (0m24.0s), 30/30 VUs, 75 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  24.0s/30s

running (0m25.0s), 30/30 VUs, 88 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  25.0s/30s

running (0m26.0s), 30/30 VUs, 90 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  26.0s/30s

running (0m27.0s), 30/30 VUs, 93 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  27.0s/30s

running (0m28.0s), 30/30 VUs, 93 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  28.0s/30s

running (0m29.0s), 30/30 VUs, 96 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  29.0s/30s

running (0m30.0s), 30/30 VUs, 100 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  30.0s/30s

running (0m31.0s), 22/30 VUs, 108 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  30s

running (0m32.0s), 10/30 VUs, 120 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  30s

running (0m33.0s), 07/30 VUs, 123 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  30s

running (0m34.0s), 07/30 VUs, 123 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  30s

running (0m35.0s), 03/30 VUs, 127 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......................: 1300    36.372409/s
    checks_succeeded...................: 100.00% 1300 out of 1300
    checks_failed......................: 0.00%   0 out of 1300

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=235.41ms min=4.25ms med=165.88ms max=2.93s  p(90)=491.42ms p(95)=682.85ms
      { expected_response:true }............................................: avg=235.41ms min=4.25ms med=165.88ms max=2.93s  p(90)=491.42ms p(95)=682.85ms
    http_req_failed.........................................................: 0.00%  0 out of 1300
    http_reqs...............................................................: 1300   36.372409/s

    EXECUTION
    iteration_duration......................................................: avg=7.42s    min=5.67s  med=7.03s    max=10.51s p(90)=9.64s    p(95)=9.79s   
    iterations..............................................................: 130    3.637241/s
    vus.....................................................................: 3      min=3         max=30
    vus_max.................................................................: 30     min=30        max=30

    NETWORK
    data_received...........................................................: 35 MB  980 kB/s
    data_sent...............................................................: 199 kB 5.6 kB/s



running (0m35.7s), 00/30 VUs, 130 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  30s