src/logs/all/test-all-20250731-144148.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/test-all.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 29 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 177 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 209 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 256 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 306 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 347 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 406 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 457 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 4203    411.917265/s
    checks_succeeded...................: 100.00% 4203 out of 4203
    checks_failed......................: 0.00%   0 out of 4203

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=21.73ms  min=3ms     med=18.03ms  max=175.67ms p(90)=35.65ms  p(95)=46.03ms 
      { expected_response:true }............................................: avg=21.73ms  min=3ms     med=18.03ms  max=175.67ms p(90)=35.65ms  p(95)=46.03ms 
    http_req_failed.........................................................: 0.00%  0 out of 4203
    http_reqs...............................................................: 4203   411.917265/s

    EXECUTION
    iteration_duration......................................................: avg=215.01ms min=139.3ms med=191.88ms max=605.14ms p(90)=275.43ms p(95)=307.88ms
    iterations..............................................................: 467    45.768585/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 47 MB  4.6 MB/s
    data_sent...............................................................: 633 kB 62 kB/s



running (10.2s), 00/10 VUs, 467 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s